app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("image", "name", "description", "brand", "category", "price_retail", "currency_iso", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "category" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["category", "efw"], ["updated_at", "2015-05-26 22:23:53.174959"], ["id", 1]]